Revit 2024 API
IPerformanceAdviserRule Interface
 Base class to derive specific performance adviser rules from.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public interface IPerformanceAdviserRule
Visual Basic
Public Interface IPerformanceAdviserRule
Visual C++
public interface class IPerformanceAdviserRule
See Also
IPerformanceAdviserRule Members
Autodesk.Revit.DB Namespace